zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ltdc.c
  /* Set Total Width */
  hltdc->Instance->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
  tmp = (hltdc->Init.TotalWidth << 16U);
  hltdc->Instance->TWCR |= (tmp | hltdc->Init.TotalHeigh);

  /* Set the background color value */
  tmp = ((uint32_t)(hltdc->Init.Backcolor.Green) << 8U);
  tmp1 = ((uint32_t)(hltdc->Init.Backcolor.Red) << 16U);
  hltdc->Instance->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
  hltdc->Instance->BCCR |= (tmp1 | tmp | hltdc->Init.Backcolor.Blue);

  /* Configure the output to YCbCr 422: Enable, the CCIR hard-wired coefficients, chrominance order  */
  hltdc->Instance->EDCR &= ~(LTDC_EDCR_OCYEN | LTDC_EDCR_OCYSEL | LTDC_EDCR_OCYCO);
  hltdc->Instance->EDCR |= (uint32_t)(hltdc->Init.ExtDisp.YCbCrEn | hltdc->Init.ExtDisp.YCbCrSel | \
                                      hltdc->Init.ExtDisp.YCbCrOrder);
#if  defined(LTDC_RB0AR_ADDR)
  /* Configure rotation buffer 0 address register */
  hltdc->Instance->RB0AR &= ~(LTDC_RB0AR_ADDR);
  hltdc->Instance->RB0AR |= (uint32_t)(hltdc->Init.Rotation.Buffer0Addr);
#endif /* defined(LTDC_RB0AR_ADDR) */
#if  defined(LTDC_RB1AR_ADDR)
  /* Configure rotation buffer 1 address register */
  hltdc->Instance->RB1AR &= ~(LTDC_RB1AR_ADDR);
  hltdc->Instance->RB1AR |= (uint32_t)(hltdc->Init.Rotation.Buffer1Addr);
#endif /* defined(LTDC_RB1AR_ADDR) */
#if  defined(LTDC_RBPR_PITCH)
  /* Configure rotation pitch buffer register */
  hltdc->Instance->RBPR &= ~(LTDC_RBPR_PITCH);
  hltdc->Instance->RBPR = (uint32_t)(hltdc->Init.Rotation.BufferPitch);
#endif /* defined(LTDC_RBPR_PITCH) */
#if  defined(LTDC_RIFCR_RIFBLUE) && defined(LTDC_RIFCR_RIFGREEN) && defined(LTDC_RIFCR_RIFRED)
  /* Configure rotation intermediate frame color buffer register */
  tmp = ((uint32_t)(hltdc->Init.Rotation.InterFrameGreen) << 8U);
  tmp1 = ((uint32_t)(hltdc->Init.Rotation.InterFrameRed) << 16U);
  hltdc->Instance->RIFCR &= ~(LTDC_RIFCR_RIFBLUE | LTDC_RIFCR_RIFGREEN | LTDC_RIFCR_RIFRED);
  hltdc->Instance->RIFCR |= (uint32_t)(tmp | tmp1 | hltdc->Init.Rotation.InterFrameBlue);
#endif /* defined(LTDC_RIFCR_RIFBLUE) & defined(LTDC_RIFCR_RIFGREEN) & defined(LTDC_RIFCR_RIFRED)*/
  /* Configure the Fifo Underrun Threshold register */
  hltdc->Instance->FUTR &= ~(LTDC_FUTR_THRE);
  hltdc->Instance->FUTR = (uint32_t)(hltdc->Init.FifoUnderThresh);
  /* Enable the Transfer Error and FIFO underrun interrupts */
  __HAL_LTDC_ENABLE_IT(hltdc, LTDC_IT_TE | LTDC_IT_FU);

  __HAL_LTDC_ENABLE_SECURE_IT(hltdc, LTDC_IT_TE | LTDC_IT_FU);

  /* Enable LTDC by setting LTDCEN bit */
  __HAL_LTDC_ENABLE(hltdc);

  /* Initialize the error code */
  hltdc->ErrorCode = HAL_LTDC_ERROR_NONE;

  /* Initialize the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  De-initialize the LTDC peripheral.
  * @param  hltdc  pointer to a LTDC_HandleTypeDef structure that contains
  *                the configuration information for the LTDC.
  * @retval None
  */

HAL_StatusTypeDef HAL_LTDC_DeInit(LTDC_HandleTypeDef *hltdc)
{
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
  if (hltdc->MspDeInitCallback == NULL)
  {
    hltdc->MspDeInitCallback = HAL_LTDC_MspDeInit;
  }
  /* DeInit the low level hardware */
  hltdc->MspDeInitCallback(hltdc);
#else
  /* DeInit the low level hardware */
  HAL_LTDC_MspDeInit(hltdc);
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

  /* Initialize the error code */
  hltdc->ErrorCode = HAL_LTDC_ERROR_NONE;

  /* Initialize the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief  Initialize the LTDC MSP.
  * @param  hltdc  pointer to a LTDC_HandleTypeDef structure that contains
  *                the configuration information for the LTDC.
  * @retval None
  */
__weak void HAL_LTDC_MspInit(LTDC_HandleTypeDef *hltdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LTDC_MspInit could be implemented in the user file
   */
}

/**
  * @brief  De-initialize the LTDC MSP.
  * @param  hltdc  pointer to a LTDC_HandleTypeDef structure that contains
  *                the configuration information for the LTDC.
  * @retval None
  */
__weak void HAL_LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LTDC_MspDeInit could be implemented in the user file
   */
}

#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User LTDC Callback
  *         To be used instead of the weak predefined callback
  * @param hltdc ltdc handle
  * @param CallbackID ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_LTDC_LINE_EVENT_CB_ID Line Event Callback ID
  *          @arg @ref HAL_LTDC_RELOAD_EVENT_CB_ID Reload Event Callback ID
  *          @arg @ref HAL_LTDC_ERROR_CB_ID Error Callback ID
  *          @arg @ref HAL_LTDC_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_LTDC_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param pCallback pointer to the Callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_LTDC_RegisterCallback(LTDC_HandleTypeDef *hltdc, HAL_LTDC_CallbackIDTypeDef CallbackID,
                                            pLTDC_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hltdc->ErrorCode |= HAL_LTDC_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }
  /* Process locked */
  __HAL_LOCK(hltdc);

  if (hltdc->State == HAL_LTDC_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_LTDC_LINE_EVENT_CB_ID :
        hltdc->LineEventCallback = pCallback;
        break;

      case HAL_LTDC_RELOAD_EVENT_CB_ID :
        hltdc->ReloadEventCallback = pCallback;
        break;

      case HAL_LTDC_ERROR_CB_ID :
        hltdc->ErrorCallback = pCallback;
        break;

      case HAL_LTDC_SECURE_LINE_EVENT_CB_ID :
        hltdc->SecureLineEventCallback = pCallback;
        break;

