zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ltdc.c
  /* set the pitch */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = ((((0x10000U - (pLayerCfg->ImageWidth * stride))) << 16U) |
                                         ((HorInputSize * stride)  + 7U));

  /* Set the Immediate Reload type */
  hltdc->Instance->SRCR = LTDC_SRCR_IMR;

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief  Disable vertical mirroring.
  * @param  hltdc     pointer to a LTDC_HandleTypeDef structure that contains
  *                   the configuration information for the LTDC.
  * @param  pLayerCfg  pointer to a LTDC_LayerCfgTypeDef structure that contains
  *                    the configuration information for the Layer.
  * @param  LayerIdx  LTDC Layer index.
  *                   This parameter can be one of the following values:
  *                   LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1) or LTDC_LAYER_3 (2)
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_DisableVMirror(LTDC_HandleTypeDef *hltdc, const LTDC_LayerCfgTypeDef *pLayerCfg,
                                          uint32_t LayerIdx)
{
  uint32_t stride;
  uint32_t HorInputSize;

  /* Check the parameters */
  assert_param(IS_LTDC_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  if (((LTDC_LAYER(hltdc, LayerIdx)->C1R & LTDC_LxC1R_SCA) == LTDC_LxC1R_SCA) && (pLayerCfg->Scaler.Enable == 1U))
  {
    HorInputSize = pLayerCfg->Scaler.HorInputSize;
  }
  else
  {
    HorInputSize = pLayerCfg->WindowX1 - pLayerCfg->WindowX0;
  }

  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
      stride = 4U;
      break;
    case LTDC_PIXEL_FORMAT_RGB888:
      stride = 3U;
      break;
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_AL88:
    case LTDC_PIXEL_FORMAT_UYVY:
    case LTDC_PIXEL_FORMAT_VYUY:
    case LTDC_PIXEL_FORMAT_YVYU:
    case LTDC_PIXEL_FORMAT_YUYV:
      stride = 2U;
      break;
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    default:
      stride = 1U;
      break;
  }

  /* Configure the color frame buffer start address */
  LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
  LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_NV12:
    case LTDC_PIXEL_FORMAT_NV21:
      /* Configure the auxiliary frame buffer address 0 */
      LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
      LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0;

      /* Configure the auxiliary frame buffer address 1 */
      LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
      LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1;

      /* Configure the buffer length */
      LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
      LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (pLayerCfg->ImageWidth << 16U) | (HorInputSize + 7U);
      /* Configure the frame buffer line number */
      LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
      LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (pLayerCfg->ImageHeight) >> 1U ;
      break;
    case LTDC_PIXEL_FORMAT_YUV420:
    case LTDC_PIXEL_FORMAT_YVU420:
      /* Configure the auxiliary frame buffer address 0 */
      LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
      LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0;

      /* Configure the auxiliary frame buffer address 1 */
      LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
      LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1;

      /* Configure the buffer length */
      LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
      LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((pLayerCfg->ImageWidth >> 1U) << 16U) |
                                           ((HorInputSize >> 1U) + 7U);
      /* Configure the frame buffer line number */
      LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
      LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (pLayerCfg->ImageHeight) >> 1U;
      break;
    default :
      break;
  }

  /* Configure the color frame buffer pitch in byte */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLR  &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
  LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = (((pLayerCfg->ImageWidth * stride) << 16U) |
                                         ((HorInputSize * stride)  + 7U));

  /* Set the Immediate Reload type */
  hltdc->Instance->SRCR = LTDC_SRCR_IMR;

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}
/**
  * @brief  Enable Dither.
  * @param  hltdc  pointer to a LTDC_HandleTypeDef structure that contains
  *                the configuration information for the LTDC.
  * @retval  HAL status
  */

HAL_StatusTypeDef HAL_LTDC_EnableDither(LTDC_HandleTypeDef *hltdc)
{
  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Enable Dither by setting DTEN bit */
  LTDC->GCR |= (uint32_t)LTDC_GCR_DEN;

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief  Disable Dither.
  * @param  hltdc  pointer to a LTDC_HandleTypeDef structure that contains
  *                the configuration information for the LTDC.
  * @retval  HAL status
  */

HAL_StatusTypeDef HAL_LTDC_DisableDither(LTDC_HandleTypeDef *hltdc)
{
  /* Process locked */
  __HAL_LOCK(hltdc);

