zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ltdc.c
#if !defined(STM32MP21xxxx)
  if (hltdc->Init.RotEn == 0U)
  {
    /* Configure the horizontal start and stop position */
    tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U)) << 16U);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U) \
                                           + 1U) | tmp);

    /* Configure the vertical start and stop position */
    tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16U);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR  = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1U) \
                                           | tmp);
  }
  else
  {
    /* Configure the horizontal start and stop position */
    tmp = ((pLayerCfg->WindowX1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16U);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1U) | tmp);

    /* Configure the vertical start and stop position */
    tmp = ((pLayerCfg->WindowY1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U)) << 16U);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR  = ((pLayerCfg->WindowY0 \
                                            + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U) + 1U) | tmp);
  }
#else
  /* Configure the horizontal start and stop position */
  tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U)) << 16U);
  LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
  LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U) \
                                         + 1U) | tmp);

  /* Configure the vertical start and stop position */
  tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16U);
  LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
  LTDC_LAYER(hltdc, LayerIdx)->WVPCR  = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1U) \
                                         | tmp);
#endif /* !defined(STM32MP21xxxx) */

  /* Configure the default color values */
  tmp = ((uint32_t)(pLayerCfg->Backcolor.Green) << 8U);
  tmp1 = ((uint32_t)(pLayerCfg->Backcolor.Red) << 16U);
  tmp2 = (pLayerCfg->Alpha0 << 24U);
  LTDC_LAYER(hltdc, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED |
                                         LTDC_LxDCCR_DCALPHA);
  LTDC_LAYER(hltdc, LayerIdx)->DCCR = (pLayerCfg->Backcolor.Blue | tmp | tmp1 | tmp2);

  /* Specifies the constant alpha value */
  LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
  LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

  /* Specifies the pixel format */
  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB1555:
      PSIZE = 2U;
      ALEN = 1U;
      APOS = 15U;
      RLEN = 5U;
      RPOS = 10U;
      GLEN = 5U;
      GPOS = 5U;
      BLEN = 5U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_ARGB4444:
      PSIZE = 2U;
      ALEN = 4U;
      APOS = 12U;
      RLEN = 4U;
      RPOS = 8U;
      GLEN = 4U;
      GPOS = 4U;
      BLEN = 4U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_L8:
      PSIZE = 1U;
      ALEN = 0U;
      APOS = 0U;
      RLEN = 8U;
      RPOS = 0U;
      GLEN = 8U;
      GPOS = 0U;
      BLEN = 8U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_AL44:
      PSIZE = 1U;
      ALEN = 4U;
      APOS = 4U;
      RLEN = 4U;
      RPOS = 0U;
      GLEN = 4U;
      GPOS = 0U;
      BLEN = 4U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_AL88:
      PSIZE = 2U;
      ALEN = 8U;
      APOS = 8U;
      RLEN = 8U;
      RPOS = 0U;
      GLEN = 8U;
      GPOS = 0U;
      BLEN = 8U;
      BPOS = 0U;
      break;
    default :
      break;
  }

  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_RGB888:
      LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);
      LTDC_LAYER(hltdc, LayerIdx)->FPF0R = 0U;
      LTDC_LAYER(hltdc, LayerIdx)->FPF1R = 0U;
      break;
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    case LTDC_PIXEL_FORMAT_AL88:
      LTDC_LAYER(hltdc, LayerIdx)->PFCR = 0x7U;
      LTDC_LAYER(hltdc, LayerIdx)->FPF0R = (RLEN << 14U)  + (RPOS << 9U) + (ALEN << 5U) + APOS;
      LTDC_LAYER(hltdc, LayerIdx)->FPF1R = (PSIZE << 18U)  + (BLEN << 14U)  + (BPOS << 9U) + (GLEN << 5U) + GPOS;
      break;
    default :
      break;
  }

  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
      stride = 4U;
      break;
    case LTDC_PIXEL_FORMAT_RGB888:
      stride = 3U;
      break;
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_AL88:
    case LTDC_PIXEL_FORMAT_UYVY:
    case LTDC_PIXEL_FORMAT_VYUY:
    case LTDC_PIXEL_FORMAT_YVYU:
    case LTDC_PIXEL_FORMAT_YUYV:
      stride = 2U;
      break;
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    default:
      stride = 1U;
      break;
  }

  /* Configure the frame buffer line number */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLNR  &= ~(LTDC_LxCFBLNR_CFBLNBR);
  LTDC_LAYER(hltdc, LayerIdx)->CFBLNR  = (pLayerCfg->ImageHeight);

