zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ltdc.c
  /* set the pitch */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = ((((0x10000U - (pLayerCfg->ImageWidth * stride))) << 16U) |
                                         ((HorInputSize * stride)  + 7U));
  /* YUV configurations */
  if ((LTDC_LAYER(hltdc, LayerIdx)->C1R & (LTDC_LxC1R_YIA | LTDC_LxC1R_YSPA | LTDC_LxC1R_YFPA)) ==
      (LTDC_LxC1R_YIA | LTDC_LxC1R_YSPA | LTDC_LxC1R_YFPA))
  {
    LTDC_LAYER(hltdc, LayerIdx)->PCR  &= ~(LTDC_LxPCR_VPDEN | LTDC_LxPCR_HPDEN | LTDC_LxPCR_YCEN | LTDC_LxPCR_YCM |
                                           LTDC_LxPCR_YF | LTDC_LxPCR_CBF | LTDC_LxPCR_YREN);
    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_UYVY:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_VYUY:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN;
        break;
      case LTDC_PIXEL_FORMAT_YUYV:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | LTDC_LxPCR_YF | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_YVYU:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | LTDC_LxPCR_YF;
        break;
      case LTDC_PIXEL_FORMAT_NV12:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x1U << LTDC_LxPCR_YCM_Pos) | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_NV21:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x1U << LTDC_LxPCR_YCM_Pos);
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x2U << LTDC_LxPCR_YCM_Pos) | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_YVU420:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x2U << LTDC_LxPCR_YCM_Pos);
        break;
      default :
        break;
    }
  }

  /* Specifies the blending factors */
  LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BOR | LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
  tmp = ((uint32_t)(pLayerCfg->BlendingOrder) << 16U);
  LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2 | tmp);

  /* Configure the layer burst length configuration register */
  LTDC_LAYER(hltdc, LayerIdx)->BLCR  &= ~(LTDC_LxBLCR_BL);
  LTDC_LAYER(hltdc, LayerIdx)->BLCR  = (pLayerCfg->BurstLength);
  if ((LTDC_LAYER(hltdc, LayerIdx)->C1R & LTDC_LxC1R_SCA) == LTDC_LxC1R_SCA)
  {
    if (pLayerCfg->Scaler.Enable != 0U)
    {
      /* Configure the scaler input size */
      LTDC_LAYER(hltdc, LayerIdx)->SISR &= ~(LTDC_LxSISR_SIV | LTDC_LxSISR_SIH);
      tmp = ((uint32_t)(pLayerCfg->Scaler.VerInputSize) << 16U);
      LTDC_LAYER(hltdc, LayerIdx)->SISR = (tmp | pLayerCfg->Scaler.HorInputSize);

      /* Configure the scaler output size */
      LTDC_LAYER(hltdc, LayerIdx)->SOSR &= ~(LTDC_LxSOSR_SOV | LTDC_LxSOSR_SOH);
      tmp = ((uint32_t)(pLayerCfg->Scaler.VerOutputSize) << 16U);
      LTDC_LAYER(hltdc, LayerIdx)->SOSR = (tmp | pLayerCfg->Scaler.HorOutputSize);

      /* Configure the vertical scaling factor */
      LTDC_LAYER(hltdc, LayerIdx)->SVSFR = calculateScalingFactor(pLayerCfg->Scaler.VerInputSize,
                                                                  pLayerCfg->Scaler.VerOutputSize);

      /* Configure the vertical scaling phase */
      LTDC_LAYER(hltdc, LayerIdx)->SVSPR = calculateScalingFactor(pLayerCfg->Scaler.VerInputSize,
                                                                  pLayerCfg->Scaler.VerOutputSize) ;

      /* Configure the horizontal scaling factor */
      LTDC_LAYER(hltdc, LayerIdx)->SHSFR = calculateScalingFactor(pLayerCfg->Scaler.HorInputSize,
                                                                  pLayerCfg->Scaler.HorOutputSize);

      /* Configure the vertical scaling phase */
      LTDC_LAYER(hltdc, LayerIdx)->SHSPR = calculateScalingFactor(pLayerCfg->Scaler.HorInputSize,
                                                                  pLayerCfg->Scaler.HorOutputSize) +
                                           (1UL << SCALER_FRACTION);

      ConfigPlane += (uint32_t)LTDC_LxCR_SCEN;
    }
  }

  if ((LTDC_LAYER(hltdc, LayerIdx)->C1R & (LTDC_LxC1R_YIA | LTDC_LxC1R_YSPA | LTDC_LxC1R_YFPA)) ==
      (LTDC_LxC1R_YIA | LTDC_LxC1R_YSPA | LTDC_LxC1R_YFPA))
  {
    /* Configure the conversion YCbCr RGB */
    LTDC_LAYER(hltdc, LayerIdx)->CYR0R &= ~(LTDC_LxCYR0R_CB2B | LTDC_LxCYR0R_CR2R);
    LTDC_LAYER(hltdc, LayerIdx)->CYR0R = 0x02040199U;

    /* Configure the conversion YCbCr RGB */
    LTDC_LAYER(hltdc, LayerIdx)->CYR1R &= ~(LTDC_LxCYR1R_CR2G | LTDC_LxCYR1R_CB2G);
    LTDC_LAYER(hltdc, LayerIdx)->CYR1R = 0x006400D0U;
  }

  if ((pLayerCfg->HorMirrorEn == 0U) && (pLayerCfg->VertMirrorEn == 0U))
  {
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (pLayerCfg->ImageWidth << 16U) | (HorInputSize + 7U);
        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (pLayerCfg->ImageHeight) >> 1U ;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((pLayerCfg->ImageWidth >> 1U) << 16U) |
                                             ((HorInputSize >> 1U) + 7U);
        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (pLayerCfg->ImageHeight) >> 1U;
        break;
      default :
        break;
    }

    /* Configure the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = (((pLayerCfg->ImageWidth * stride) << 16U) |
                                           ((HorInputSize * stride)  + 7U));
  }

  if ((pLayerCfg->HorMirrorEn != 0U) && (pLayerCfg->VertMirrorEn == 0U))
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = pLayerCfg->FBStartAdress +
                                         (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0)) - 1U;

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (pLayerCfg->ImageWidth << 16U) | (HorInputSize + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U ;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((pLayerCfg->ImageWidth >> 1U) << 16U) | ((HorInputSize >> 1U) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      default :
        break;
    }

    /* Configure the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = (((pLayerCfg->ImageWidth * stride) << 16U) |
                                           ((HorInputSize * stride)  + 7U));

    /* Enable horizontal mirroring bit */
    ConfigPlane += (uint32_t)LTDC_LxCR_HMEN;
  }

  if ((pLayerCfg->HorMirrorEn == 0U) && (pLayerCfg->VertMirrorEn != 0U))
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = pLayerCfg->FBStartAdress +
                                         (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) *
                                          ((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) - 1U));

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) *
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) *
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((0x10000U - (pLayerCfg->ImageWidth * stride)) << 16U) |
                                             ((HorInputSize * stride)  + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) *
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) *
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (((0x10000U - (pLayerCfg->ImageWidth >> 1U)) * stride) << 16U) |
                                             (((HorInputSize >> 1U) * stride) + 7U);
        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      default :
        break;
    }

