zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ltdc.c
    /* set the pitch */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = ((((0x10000U - (pLayerCfg->ImageWidth * stride))) << 16U) |
                                           ((HorInputSize * stride)  + 7U));
  }

  if ((pLayerCfg->HorMirrorEn != 0U) && (pLayerCfg->VertMirrorEn != 0U))
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = pLayerCfg->FBStartAdress +
                                         (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) *
                                          (pLayerCfg->WindowY1 - pLayerCfg->WindowY0)) - 1U;

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) *
                                               ((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) *
                                               ((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((0x10000U - (pLayerCfg->ImageWidth * stride)) << 16U) |
                                             ((HorInputSize * stride)  + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) *
                                               ((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) *
                                               ((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (((0x10000U - (pLayerCfg->ImageWidth >> 1U)) * stride) << 16U) |
                                             (((HorInputSize >> 1U) * stride) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      default :
        break;
    }

    /* Enable horizontal mirroring bit */
    ConfigPlane += (uint32_t)LTDC_LxCR_HMEN;
  }

  /* Enable LTDC_Layer by setting LEN bit */
  LTDC_LAYER(hltdc, LayerIdx)->CR = ConfigPlane + LTDC_LxCR_LEN;
}

/**
  * @}
  */


/**
  * @}
  */

#endif /* LTDC */

#endif /* HAL_LTDC_MODULE_ENABLED */

/**
  * @}
  */
